<?php
$cities = array("Москва", "Казань", "Екатеринбург", "Калуга", "Астрахань", "Бавлы", "Бугульма", "Чебоксары", "Альметьевск", "Уфа", "Белебей", "Сергиев пасад", "Челябинск", "Самара", "Тольяти", "Вологда", "Томбов", "Саратов", "Тула", "Краснодар", "Сочи", "Анапа", "Орел", "Керчь", "Севастополь", "Новороссийск", "Елабуга", "Лениногорск", "Нижнекамск", "Набережные-Челны");
$shortest = -1;
foreach($cities as $city){
    $lev = levenshtein($_POST['city'], $city);
 
    if ($lev == 0) {
        $closest = $city;
        $shortest = 0;
        break;
    }
    if ($lev <= $shortest || $shortest < 0) {
        $closest  = $city;
        $shortest = $lev;
    }
}
if ($shortest == 0) {
    echo "Найдено точное совпадение: $closest\n";
} else {
    echo "Вы не имели в виду: $closest?\n";
}